In [10]:
adultdata = df[df.Age>19]
adultdata.head()

       User  Gender  Age  EstimatedSalary  Purchased
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
5  15728773       1   27            58000          0
6  15598044       0   27            84000          0